docs/ab_varnish.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.0 (be patient).....done


Server Software:        
Server Hostname:        192.168.0.0
Server Port:            3000

Document Path:          /slow_things
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   0.037 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      44471 bytes
HTML transferred:       0 bytes
Requests per second:    2687.96 [#/sec] (mean)
Time per request:       3.720 [ms] (mean)
Time per request:       0.372 [ms] (mean, across all concurrent requests)
Transfer rate:          1167.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    2   0.3      2       2
Processing:     1    2   0.4      2       3
Waiting:        0    1   0.5      1       3
Total:          2    3   0.5      4       5
WARNING: The median and mean for the total time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      4
  90%      4
  95%      4
  98%      5
  99%      5
 100%      5 (longest request)